# 1 Найдите сумму цифр трехзначного числа.



x = int(input("enter a three-digit number"))
summ = 0
while x > 0:
    summ += x % 10
    x //= 10
 
print(summ)



# 2 Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. Сколько журавликов 
# сделал каждый ребенок, если известно, что Петя и Сережа 
# сделали одинаковое количество журавликов, а Катя сделала 
# в два раза больше журавликов, чем Петя и Сережа вместе?





a = int(input("how many cranes"))
k = int((a/3)*2)
p = int((k/2)/2)
s = int(p)
print(p, k, s)



# 3 Вы пользуетесь общественным транспортом? Вероятно, 
вы расплачивались за проезд и получали билет с номером.
Счастливым билетом называют такой билет с шестизначным номером, 
где сумма первых трех цифр равна сумме последних трех.
Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
ам требуется написать программу, которая проверяет счастливость билета.




a = input("enter the first 3 digits")
b = input("enter the second 3 digits")

if a == b:
    print("lucky ticket")
else:
    print("not a lucky ticket")
    



# 4 Требуется определить, можно ли от шоколадки размером n × m долек
#  отломить k долек, если разрешается сделать один разлом по прямой 
#  между дольками (то есть разломить шоколадку на два прямоугольника).



n = int(input("enter a number n"))
m = int(input("enter a number m"))
k = int(input("enter a number k"))
if k < n * m and ((k % n == 0) or (k % m == 0)):
    print('YES')
else:
    print('NO')
